{
    "added": [
        {
            "title": "Added new keyboard shortcuts",
            "subtitle": "Toggle Always-on-Top, Move Window to Center, Restore Window Size, Toggle Vertical/Horizontal Maximization."
        },
        {
            "title": "Move tile groups to a new workspace/monitor with the Tile Editing Mode",
            "subtitle": "Shift+Directions moves the tile group to a new monitor; Shift+Alt+Directions to a new workspace."
        },
        {
            "title": "Tiled windows will untile if they change workspaces or monitors",
            "subtitle": "Use the Tile Editing Mode to move tile groups to a different workspace/monitor"
        },
        {
            "title": "Allow one action to have multiple keyboard shortcuts",
            "subtitle": "Press 'Enter' or 'Space' when listening for a new keyboard shortcut to append to existing ones."
        }
    ],
    "removed": [

    ],
    "changed": [
        {
            "title": "Adapt edge-tiling only if it doesn't cover existing tiles and their tile groups",
            "subtitle": "Use Ctrl-drag (mouse) or the Tile Editing Mode (keyboard) to 'replace/cover' existing tiles. That way 1 window can be part of multiple tile groups."
        },
        {
            "title": "Reworked tile group detection"
        },
        {
            "title": "Renamed 'Split Tiles' mode to 'Adaptive Tiling'",
            "subtitle": "This is the mode when moving a window around while holding Ctrl."
        },
        {
            "title": "Disabled grouping tiled windows in the app switcher by default and mark that setting as experimental"
        },
        {
            "title": "Deprecated the 'Toggle Tiling Popup' and 'Auto-Tile' keyboard shortcuts",
            "subtitle": "Deprecated settings won't be visible in the prefs window anymore unless they have a non-default value set."
        }

    ],
    "fixed": [
        {
            "title": "Fixed a compatibility issue introduced in v31 with other alt-Tab extensions"
        },
        {
            "title": "Fixed the Tiling Popup ignoring the Tile Group setting 'App Switcher and Tiling Popup'"
        },
        {
            "title": "Shortcuts may no longer change unintentionally after using the clear-shortcut-button"
        },
        {
            "title": "Fixed the URLs in the prefs' popup menu freezing the prefs (Wayland only)"
        }
    ]
}